IdeaRS.OpenModel.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

IdeaRS.OpenModel.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

IdeaRS.OpenModel.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

IdeaRS.OpenModel.Properties.Resources.ErrBoltsTooClose
Looks up a localized string similar to Bolts are too close to each other..

IdeaRS.OpenModel.Properties.Resources.ErrBoltsTooCloseEdge
Looks up a localized string similar to Bolts are too close to plate edge or outside of the connected plate..

IdeaRS.OpenModel.Properties.Resources.ErrContactsAngle
Looks up a localized string similar to Angle of plates in contact is out of limit (sin(alfa) > 0.001)..

IdeaRS.OpenModel.Properties.Resources.ErrCurveDecreaseFunction
Looks up a localized string similar to The curve mustn't be a decrease function..

IdeaRS.OpenModel.Properties.Resources.ErrCurveDerivation
Looks up a localized string similar to The curve derivation is out of range..

IdeaRS.OpenModel.Properties.Resources.ErrCurveFunction
Looks up a localized string similar to The curve isn't a function..

IdeaRS.OpenModel.Properties.Resources.ErrCurveNotSet
Looks up a localized string similar to The curve isn't set..

IdeaRS.OpenModel.Properties.Resources.ErrCurveZeroPoint
Looks up a localized string similar to The curve doesn't contain the point (0, 0)..

IdeaRS.OpenModel.Properties.Resources.ErrDataObjectNotCreated
Looks up a localized string similar to The Data object in Data Model was not created. Internal error..

IdeaRS.OpenModel.Properties.Resources.ErrIncorrectMaterialEGP
Looks up a localized string similar to Material properties don't satisfy the condition: "(1.0 - E / (2.0 * (1.0 + Poisson) * G)) < 0.01"..

IdeaRS.OpenModel.Properties.Resources.ErrIncorrentMaterialE
Looks up a localized string similar to Incorrect material E-modulus..

IdeaRS.OpenModel.Properties.Resources.ErrNoCrossSectionParameter
Looks up a localized string similar to No cross-section parameter in the Open Model Cross-section .

IdeaRS.OpenModel.Properties.Resources.ErrNoEquivalentObjectInDataModel
Looks up a localized string similar to No equivalent Data object in the Data Model..

IdeaRS.OpenModel.Properties.Resources.ErrNoObjectInOpenModel
Looks up a localized string similar to No Open Model object in the Idea Open Model..

IdeaRS.OpenModel.Properties.Resources.ErrNoOpenObject
Looks up a localized string similar to No Open Model object..

IdeaRS.OpenModel.Properties.Resources.ErrNoReferenceObjectInOpenModel
Looks up a localized string similar to No referenced Open Model object in the Idea Open Model..

IdeaRS.OpenModel.Properties.Resources.Error
Looks up a localized string similar to Error.

IdeaRS.OpenModel.Properties.Resources.ErrPreloadedBoltGrade
Looks up a localized string similar to Bolt grade is not allowed in slip-resistant joints..

IdeaRS.OpenModel.Properties.Resources.ErrValidPolyline
Looks up a localized string similar to The geometry of the polyline is not valid. The segments are not continuous or they have a different orientation..

IdeaRS.OpenModel.Properties.Resources.ErrValueOutOfRange
Looks up a localized string similar to The value is out of the range..

IdeaRS.OpenModel.Properties.Resources.GeneralError
Looks up a localized string similar to General error.

IdeaRS.OpenModel.Properties.Resources.GeneralInformation
Looks up a localized string similar to General information.

IdeaRS.OpenModel.Properties.Resources.GeneralWarning
Looks up a localized string similar to General warning.

IdeaRS.OpenModel.Properties.Resources.Information
Looks up a localized string similar to Information.

IdeaRS.OpenModel.Properties.Resources.Object
Looks up a localized string similar to Object.

IdeaRS.OpenModel.Properties.Resources.Property
Looks up a localized string similar to Property.

IdeaRS.OpenModel.Properties.Resources.Reserved
Looks up a localized string similar to Reserved.

IdeaRS.OpenModel.Properties.Resources.Unspecified
Looks up a localized string similar to Unspecified.

IdeaRS.OpenModel.Properties.Resources.WarnCurveCount
Looks up a localized string similar to The number of points of the curve is exceed 100..

IdeaRS.OpenModel.Properties.Resources.Warning
Looks up a localized string similar to Warning.

IdeaRS.OpenModel.Properties.Resources.WarnNoPropertyInData
Looks up a localized string similar to No equivalent property in the Data object.

IdeaRS.OpenModel.Properties.Resources.WarnReinforcementBarsCollision
Looks up a localized string similar to Some of bars in the reinforced cross-section are in collision..

IdeaRS.OpenModel.Properties.Resources.WarnValueOutOfRange
Looks up a localized string similar to The value is out of the range..